IsDemolishedPhaseOrderValid Method
 Returns true if createdPhaseId and demolishedPhaseId are in order.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public bool IsDemolishedPhaseOrderValid(
	ElementId demolishedPhaseId
)
Visual Basic
Public Function IsDemolishedPhaseOrderValid ( _
	demolishedPhaseId As ElementId _
) As Boolean
Visual C++
public:
bool IsDemolishedPhaseOrderValid(
	ElementId^ demolishedPhaseId
)
Parameters
demolishedPhaseId
Type: Autodesk.Revit.DBElementId
 The demolishedPhaseId.
Return Value
 True if createdPhaseId index is less than or equal to demolishedPhaseId, otherwise returns false.
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsArgumentNullException |  A non-optional argument was null
See Also
Element Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →